app/controllers/comments_controller.rb

	def create
    # byebug
    @post = Post.friendly.find(params[:post_id])
    @comment = @post.comment.create(comment_params)
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 52 LIMIT 1
INSERT INTO `comments` (`content`, `created_at`, `post_id`, `updated_at`) VALUES ('fffff', '2014-11-04 11:26:47', 52, '2014-11-04 11:26:47')