app/controllers/home_controller.rb

	def index
    @posts = Post.friendly.order('created_at DESC').page params[:page]
---
SELECT  `posts`.* FROM `posts`   ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`

	def show
		@post = Post.friendly.find(params[:id])
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 52 LIMIT 1