app/controllers/posts_controller.rb

  def index
    @posts = current_user.post.order('created_at DESC').page params[:page]
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`user_id` = 1  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`  WHERE `posts`.`user_id` = 1

  def create
   #  @post = Post.new(post_params)
   # @post.user=current_user
    @post = current_user.post.build(post_params)
    @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `title`, `updated_at`) VALUES ('ádaasdas đa asd asdas ád ádá đá asd asd ád', '2014-11-03 03:31:45', 'adaadasaá', '2014-11-03 03:31:45')

  def update
    @post.update(post_params)
---
UPDATE `posts` SET `content` = 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was populari', `title` = 'Callback Methods —', `updated_at` = '2014-11-03 04:53:38' WHERE `posts`.`id` = 19

  def destroy
    @post.destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 1

    def set_post
      @post = Post.friendly.find(params[:id])
---
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`id` = 11 LIMIT 1